---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalEquipment.GetCircuitNamingSchemeType
source: html/561904cf-6c9a-ed77-5b53-d5e647a98f15.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalEquipment.GetCircuitNamingSchemeType Method

Gets enumerated type of the circuit naming scheme used with Electrical Equipment.

## Syntax (C#)
```csharp
public CircuitNaming GetCircuitNamingSchemeType()
```

## Returns
The enumerated type of circuit naming scheme.